---
kind: method
id: M:Autodesk.Revit.DB.ExportFontTable.Dispose
source: html/473351c4-e527-8550-1da9-fd4a6288cf51.htm
---
# Autodesk.Revit.DB.ExportFontTable.Dispose Method

Releases all resources used by the ExportFontTable

## Syntax (C#)
```csharp
public void Dispose()
```